Documents/ИзучениеЭлектронногоКурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзучениеЭлектронногоКурса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</xr:Item>
				<xr:Item>InformationRegister.ОтветыНаТестовыеВопросы</xr:Item>
				<xr:Item>InformationRegister.ИзученныеЭлектронныеКурсы</xr:Item>
				<xr:Item>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</xr:Item>
				<xr:Item>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтекстЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчащийсяЭлектронногоОбучения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИзучения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПоследнийЭлементСодержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоТестовоеИзучение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтоРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТестировщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПопыткиИзучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПопытки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзучениеЭлектронногоКурса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
		Метаданные.Документы.ИзучениеЭлектронногоКурса.Реквизиты.Учащийся,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет поиск документа по переданному контексту
//
Функция НайтиПоКонтексту(Знач ЭлектронныйКурс, Знач Контекст, Знач Учащийся) Экспорт
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Контекст) ИЛИ НЕ ЗначениеЗаполнено(Учащийся) ИЛИ НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		ВызватьИсключение НСтр("ru = 'Контекст поиска документа изучения электронного курса не задан'");
	КонецЕсли;		
	
	// Ищем документ изучения электронного курса по контексту
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИзучениеЭлектронногоКурса.Ссылка КАК ИзучениеЭлектронногоКурса
		|ИЗ
		|	Документ.ИзучениеЭлектронногоКурса КАК ИзучениеЭлектронногоКурса
		|ГДЕ
		|	ИзучениеЭлектронногоКурса.ЭлектронныйКурс = &ЭлектронныйКурс
		|	И ИзучениеЭлектронногоКурса.Учащийся = &Учащийся
		|	И ИзучениеЭлектронногоКурса.Контекст = &Контекст
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзучениеЭлектронногоКурса.Дата УБЫВ";		
	
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);	
	Запрос.УстановитьПараметр("Контекст", Контекст);	
	Запрос.УстановитьПараметр("Учащийся", Учащийся);			
	
	УстановитьПривилегированныйРежим(Истина); // Для доступа учащимся

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();		
		
		Возврат ВыборкаДетальныеЗаписи.ИзучениеЭлектронногоКурса;
		
	КонецЕсли;	
	
КонецФункции

Функция ДанныеОбИзучении(ИзучениеЭлектронногоКурса, Знач ВключатьРасширеннуюСтатистику = Ложь) Экспорт
	
	Возврат ИзучениеЭлектронныхКурсовСлужебный.ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса,,,, ВключатьРасширеннуюСтатистику);
	
КонецФункции

Функция ПрогрессИзучения(ИзучениеЭлектронногоКурса) Экспорт
	
	Возврат ДанныеОбИзучении(ИзучениеЭлектронногоКурса).ИзученоВПроцентах;
	
КонецФункции

Функция РезультатИзучения(ИзучениеЭлектронногоКурса) Экспорт
	
	Возврат ДанныеОбИзучении(ИзучениеЭлектронногоКурса).Результат;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
